# 配列の末尾に追加
a = [1, 2, 3]
a.push(4)
print a
# [1, 2, 3, 4]

puts "\n"
puts "-----"

a = [1, 2, 3]
a.push(4, 5)
print a
# [1, 2, 3, 4, 5]

puts "\n"
puts "-----"

a = [1, 2, 3]
a << 4
print a
# [1, 2, 3, 4]

puts "\n"
puts "-----"

a = [1, 2, 3]
a.insert(2, 4)
print a
# [1, 2, 4, 3]

puts "\n"
puts "-----"

# 第１引数にマイナスの値を指定すると末尾から計算した位置に要素が挿入
a = [1, 2, 3]
a.insert(-2, 4)
print a
# [1, 4, 2, 3]

puts "\n"
puts "-----"

# 複数要素を同時に挿入する場合は、第３引数以降に要素を渡すことで追加...ややこし
a = [1, 2, 3]
a.insert(2, 4, 5)
print a
# [1, 2, 4, 5, 3]

puts "\n"
puts "-----"

# 要素を先頭に挿入
a = [1, 2, 3]
a.unshift(4)
print a
# [4, 1, 2, 3]

puts "\n"
puts "-----"

# 複数要素を同時に先頭に挿入する場合は、第２引数以降に要素を渡すことで挿入
a = [1, 2, 3]
a.unshift(4, 5)
print a
# [4, 5, 1, 2, 3]